espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/usb_serial_jtag_reg.h
/** USB_SERIAL_JTAG_ECO_HIGH_APB_REG register
 *  Reserved.
 */
#define USB_SERIAL_JTAG_ECO_HIGH_APB_REG (DR_REG_USB_SERIAL_JTAG_BASE + 0x7c)
/** USB_SERIAL_JTAG_RND_ECO_HIGH_APB : R/W; bitpos: [31:0]; default: 4294967295;
 *  Reserved.
 */
#define USB_SERIAL_JTAG_RND_ECO_HIGH_APB    0xFFFFFFFFU
#define USB_SERIAL_JTAG_RND_ECO_HIGH_APB_M  (USB_SERIAL_JTAG_RND_ECO_HIGH_APB_V << USB_SERIAL_JTAG_RND_ECO_HIGH_APB_S)
#define USB_SERIAL_JTAG_RND_ECO_HIGH_APB_V  0xFFFFFFFFU
#define USB_SERIAL_JTAG_RND_ECO_HIGH_APB_S  0

/** USB_SERIAL_JTAG_ECO_CELL_CTRL_APB_REG register
 *  Reserved.
 */
#define USB_SERIAL_JTAG_ECO_CELL_CTRL_APB_REG (DR_REG_USB_SERIAL_JTAG_BASE + 0x80)
/** USB_SERIAL_JTAG_RDN_RESULT_APB : RO; bitpos: [0]; default: 0;
 *  Reserved.
 */
#define USB_SERIAL_JTAG_RDN_RESULT_APB    (BIT(0))
#define USB_SERIAL_JTAG_RDN_RESULT_APB_M  (USB_SERIAL_JTAG_RDN_RESULT_APB_V << USB_SERIAL_JTAG_RDN_RESULT_APB_S)
#define USB_SERIAL_JTAG_RDN_RESULT_APB_V  0x00000001U
#define USB_SERIAL_JTAG_RDN_RESULT_APB_S  0
/** USB_SERIAL_JTAG_RDN_ENA_APB : R/W; bitpos: [1]; default: 0;
 *  Reserved.
 */
#define USB_SERIAL_JTAG_RDN_ENA_APB    (BIT(1))
#define USB_SERIAL_JTAG_RDN_ENA_APB_M  (USB_SERIAL_JTAG_RDN_ENA_APB_V << USB_SERIAL_JTAG_RDN_ENA_APB_S)
#define USB_SERIAL_JTAG_RDN_ENA_APB_V  0x00000001U
#define USB_SERIAL_JTAG_RDN_ENA_APB_S  1

/** USB_SERIAL_JTAG_SRAM_CTRL_REG register
 *  PPA SRAM Control Register
 */
#define USB_SERIAL_JTAG_SRAM_CTRL_REG (DR_REG_USB_SERIAL_JTAG_BASE + 0x84)
/** USB_SERIAL_JTAG_MEM_AUX_CTRL : R/W; bitpos: [13:0]; default: 4896;
 *  Control signals
 */
#define USB_SERIAL_JTAG_MEM_AUX_CTRL    0x00003FFFU
#define USB_SERIAL_JTAG_MEM_AUX_CTRL_M  (USB_SERIAL_JTAG_MEM_AUX_CTRL_V << USB_SERIAL_JTAG_MEM_AUX_CTRL_S)
#define USB_SERIAL_JTAG_MEM_AUX_CTRL_V  0x00003FFFU
#define USB_SERIAL_JTAG_MEM_AUX_CTRL_S  0

/** USB_SERIAL_JTAG_DATE_REG register
 *  Date register
 */
#define USB_SERIAL_JTAG_DATE_REG (DR_REG_USB_SERIAL_JTAG_BASE + 0x88)
/** USB_SERIAL_JTAG_DATE : R/W; bitpos: [31:0]; default: 34676752;
 *  register version.
 */
#define USB_SERIAL_JTAG_DATE    0xFFFFFFFFU
#define USB_SERIAL_JTAG_DATE_M  (USB_SERIAL_JTAG_DATE_V << USB_SERIAL_JTAG_DATE_S)
#define USB_SERIAL_JTAG_DATE_V  0xFFFFFFFFU
#define USB_SERIAL_JTAG_DATE_S  0

#ifdef __cplusplus
}
#endif
